Repository: montymobile1/montyesim-eshop-SDK-iOS
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, fr

# refer.reel2.message
source: Your friends get $3 off their first eSIM purchase using your referral code.
ar: يحصل أصدقاؤك على خصم بنسبة 3% على أول عملية شراء لشريحة eSIM باستخدام رمز الإحالة الخاص بك.

# refer.reel2.title
source: Discount for Your Friends
ar: خصم لأصدقائك

# refer.reel3.message
source: You'll earn $3 wallet credit for each successful referral.
ar: ستحصل على رصيد محفظة بنسبة 3% لكل إحالة ناجحة.

# refer.reel3.title
source: Referral Rewards for You
ar: مكافآت الإحالة لك

# ReferEarn.title
source: Refer & Earn
ar: قم بالإحالة واكسب

# referral_code_activated
source: Referral code activated successfully
ar: تم تفعيل رمز الإحالة بنجاح
fr: Code de parrainage activé avec succès

# referto.title
source: Refer to
ar: راجع

# regionsbundle.title
source: No region bundles found
ar: لم يتم العثور على حزم المناطق

source: Reject
ar: رفض
fr: Refuser

source: Request
ar: الطلب
fr: Demander

# request_button
source: Request
ar: طلب
fr: Demander

source: Request not available
ar: الطلب غير متوفر
fr: Demande non disponible

# resend_countdown_title
source: Resend in %ds
ar: إعادة الإرسال في %ds
fr: Renvoyer dans %ds

# resend_via_email_title
source: Resend via Email
ar: إعادة إرسال عبر البريد الإلكتروني
fr: Renvoyer par E-mail

# resend_via_sms_title
source: Resend via SMS
ar: إعادة إرسال عبر الرسائل النصية
fr: Renvoyer par SMS

# resend.code.title
source: resend Code
ar: إعادة إرسال الرمز

# rewardHistory_cashbackTypeTitle
source: Cashback
ar: الاسترداد النقدي

# rewardHistory_emptyContentText
source: You haven't earned any rewards yet. Start referring your friends to get rewarded!
ar: لم تحصل على أي مكافأة حتى الآن. ابدأ بإحالة الأصدقاء للحصول على مكافأة!
fr: Vous n’avez encore gagné aucune récompense. Commencez à parrainer vos amis pour être récompensé !

# rewardHistory_emptyTitleText
source: No rewards yet
ar: لا توجد مكافآت حتى الآن
fr: Aucune récompense pour le moment

# rewardHistory_referTypeTitle
source: Refer & Earn
ar: قم بالإحالة واكسب
fr: Parrainez et gagnez

# rewardHistory_titleText
source: Rewards History
ar: سجل المكافآت
fr: Historique des récompenses

source: Rewards
ar: مكافآت
fr: Récompenses

# RewardsHistory.title
source: Rewards History
ar: سجل المكافآت

# save.title
source: Save
ar: حفظ

# scan.toinstall.title
source: You can scan it here and share it with your friends.
ar: يمكنك مسحها هنا ومشاركتها مع أصدقائك

# search.plan.title
source: Search your plans ….
ar: ابحث عن حزم

source: second
ar: ثانية
fr: seconde

source: seconds
ar: ثوان
fr: secondes

# select_a_method
source: Select a method according to your device ability
ar: اختر الطريقة حسب إمكانيات جهازك
fr: Sélectionnez une méthode selon les capacités de votre appareil

source: Send
ar: إرسال
fr: Envoyer

# SendMessage.title
source: Send Message
ar: أرسل رسالة

source: Services
ar: خدمات

source: Settings
ar: إعدادات
fr: Paramètres

# settings.title
source: Settings
ar: إعدادات

source: SHARE
ar: شارك
fr: PARTAGER

# share.title
source: Share Now
ar: شارك الآن

# shareReferral_buttonText
source: Share Now
ar: شارك الآن
fr: Partager maintenant

# shareReferral_contentText
source: Once your friends successfully purchase their first eSIM using your referral code, you'll receive a {amount} reward in your wallet.
ar: بمجرد أن يقوم أصدقاؤك بشراء أول شريحة eSIM باستخدام رمز الإحالة الخاص بك، ستحصل على مكافأة بنسبة {amount} في محفظة Monty eSIM الخاصة بك.
fr: Une fois que vos amis auront acheté leur première eSIM avec votre code, vous recevrez une récompense de {amount} dans votre portefeuille.

# shareReferral_fullLinkText
source: Hey, have you tried an eSIM? Get {amount} off your first eSIM data pack. Use code {code} at checkout to redeem your discount. {link}
ar: مرحبًا، هل جربت eSIM؟ احصل على {amount} خصم على حزمة بيانات eSIM الأولى من مونتي eSIM. استخدم الرمز {code} وقم بتطبيقه عند الدفع.{link}
fr: Salut, as-tu déjà essayé une eSIM ? Obtiens {amount} de réduction sur ton premier forfait eSIM. Utilise le code {code} à la caisse pour profiter de la réduction. {link}

# shareReferral_hintText
source: Your Referral Code
ar: كود الإحالة الخاص بك
fr: Votre code de parrainage

# shareReferral_titleText
source: Refer Your Friends
ar: قم بإحالة أصدقائك
fr: Parrainez vos amis

source: Sign in Via Email
ar: تسجيل الدخول عبر البريد الإلكتروني
fr: Se connecter via Email

source: Sign in Via SMS
ar: تسجيل الدخول عبر الرسائل القصيرة
fr: Se connecter via SMS

source: Skip
ar: تخطي
fr: Passer

# SM.DP.Address.title
source: SM-DP+ Address
ar: عنوان SM-DP+

source: SM-DP+ Address
ar: عنوان SM-DP+
fr: Adresse SM-DP+

source: Something went wrong
ar: حدث خطأ ما
fr: Une erreur s’est produite

source: Status
ar: الحالة
fr: Statut

# status_active
source: active
ar: نشط
fr: actif

# status_expired
source: expired
ar: منتهي الصلاحية
fr: expiré

# status_inactive
source: inactive
ar: غير نشط
fr: inactif

# stayconnected.message
source: Our App allows you to buy international eSIM profiles & data bundles wherever you are!
ar: تطبيقنا يسمح لك بشراء شريحة إلكترونية دولية وحزم بيانات أينما كنت
fr: Notre application vous permet d’acheter des profils eSIM internationaux et des forfaits data où que vous soyez

# stayconnected.title
source: Stay connected at sea!
ar: ابقَ على اتصال في البحر!
fr: Restez connecté en mer !

source: Step 1
ar: الخطوة ١
fr: Étape 1

source: Step 2
ar: الخطوة ٢
fr: Étape 2

source: Step 3
ar: الخطوة ٣
fr: Étape 3

source: Step 4
ar: الخطوة ٤
fr: Étape 4

source: Step 5
ar: الخطوة ٥
fr: Étape 5

source: Step 6
ar: الخطوة ٦
fr: Étape 6

source: Step 7
ar: الخطوة ٧
fr: Étape 7

source: Step 8
ar: الخطوة ٨
fr: Étape 8

source: Step 9
ar: الخطوة ٩
fr: Étape 9

source: Step 10
ar: الخطوة ١٠
fr: Étape 10

source: Step 11
ar: الخطوة ١١
fr: Étape 11

source: Step 12
ar: الخطوة ١٢
fr: Étape 12

source: Step 13
ar: الخطوة ١٣
fr: Étape 13

source: Step 14
ar: الخطوة ١٤
fr: Étape 14

source: Step 15
ar: الخطوة ١٥
fr: Étape 15

source: Step 16
ar: الخطوة ١٦
fr: Étape 16

source: Step 17
ar: الخطوة ١٧
fr: Étape 17

source: Step 18
ar: الخطوة ١٨
fr: Étape 18

# storiesView_cashbackContent
source: {CashbackDiscount} cashback rewards will be credit to your wallet upon completing your third transaction.
ar: سيتم إضافة مكافآت الاسترداد النقدي بنسبة {CashbackDiscount} إلى محفظتك عند إكمالك للمعاملة الثالثة.
fr: {CashbackDiscount} de cashback seront crédités dans votre portefeuille après votre troisième transaction.

# storiesView_cashbackTitle
source: Enjoy Cashback Rewards
ar: استمتع بمكافآت الاسترداد النقدي
fr: Profitez des récompenses cashback

# storiesView_notNow
source: Not Now
ar: ليس الآن
fr: Pas maintenant

# storiesView_purchaseNow
source: Purchase Now
ar: شراء الآن
fr: Acheter maintenant

# storiesView_referralContent1
source: Invite your friends to experience eSIM through the app.
ar: ادعُ أصدقائك للتجربة eSIM من خلال التطبيق.
fr: Invitez vos amis à découvrir l’eSIM via l’application.

# storiesView_referralContent2
source: Your friends get {referAndEarnAmount} of there first eSIM purchase using your referral code.
ar: يحصل أصدقاؤك على خصم بنسبة {referAndEarnAmount} على أول عملية شراء لشريحة eSIM باستخدام رمز الإحالة الخاص بك.
fr: Vos amis obtiennent {referAndEarnAmount} sur leur premier achat eSIM avec votre code de parrainage.

# storiesView_referralContent3
source: you'll earn {referAndEarnAmount} wallet credit for each successful referral.
ar: ستحصل على رصيد محفظة بنسبة {referAndEarnAmount} لكل إحالة ناجحة.
fr: Vous gagnerez {referAndEarnAmount} de crédit portefeuille pour chaque parrainage réussi.

# storiesView_referralTitle1
source: Refer Your Friends
ar: قم بإحالة أصدقائك
fr: Parrainez vos amis

# storiesView_referralTitle2
source: Discount for Your Friends
ar: خصم لأصدقائك
fr: Réduction pour vos amis

# storiesView_referralTitle3
source: Referral Rewards for You
ar: مكافآت الإحالة لك
fr: Récompenses de parrainage pour vous

# storiesView_startSharing
source: Start Sharing
ar: بدء المشاركة
fr: Commencer à partager

source: Subtotal
ar: المجموع الفرعي
fr: Sous-total

source: Summary of Payment
ar: ملخص الدفع
fr: Résumé du paiement

# Summary.title
source: Summary
ar: ملخص

# supportedCountries_availableInText
source: Available in
ar: متوفر في
fr: Disponible dans

# supportedCountries_availableNetworks
source: Available Networks
ar: الشبكة المتاحة
fr: Réseaux disponibles

# supportedCountries_noNetworks
source: No networks
ar: لا توجد شبكة
fr: Aucun réseau

# supportedCountries_tittleText
source: Supported Countries
ar: البلدان المدعومة
fr: Pays supportés

# SupportedCountries.title
source: Supported Countries
ar: البلدان المدعومة

# TermsAcceptance.link
source: Terms & Conditions
ar: الشروط ولاحكام

# TermsAcceptance.prefix
source: Accept
ar: قبول

# termsConditions.title
source: Terms and Conditions
ar: الشروط ولاحكام
fr: Termes et conditions

source: The country code is invalid.
ar: رمز الدولة غير صالح

source: The number provided is invalid.
ar: الرقم المقدم غير صالح

source: The number provided is too long.
ar: الرقم المقدم طويل جداً

source: The number provided is too short.
ar: الرقم المقدم قصير جداً

source: The QR Code is being generated
ar: يتم الأن إنشاء رمز الاستجابة السريعة
fr: Le code QR est en cours de génération

# the_qr_code_was_sent
source: The QR code was sent to your email, please scan it to install it on your phone. Please refer to the User Guide for detailed instructions.
ar: تم إرسال رمز الاستجابة إلى بريدك الإلكتروني، يُرجى مسحه ضوئيًا لتثبيته على هاتفك. يرجى الرجوع إلى دليل المستخدم للحصول على تعليمات مفصلة.
fr: Le code QR a été envoyé à votre email, veuillez le scanner pour l’installer sur votre téléphone. Consultez le guide utilisateur pour des instructions détaillées.

source: This may take a while
ar: هذا قد يستغرق بعض الوقت
fr: Cela peut prendre un moment

source: Top Up
ar: شحن الرصيد
fr: Recharger

source: Top Up Plan
ar: خطة شحن الرصيد
fr: Recharger le forfait

# top_up_success_message
source: Your payment was done successfully. A topup was added to your balance, it will appear once you consumed your existing data.
ar: تمت عملية الدفع بنجاح. تمت إضافة تعبئة Ap إلى رصيدك، ستظهر بمجرد استهلاك بياناتك الحالية.
fr: Votre paiement a été effectué avec succès. La recharge a été ajoutée à votre solde, elle apparaîtra une fois que vous aurez consommé vos données existantes.

# topup.success.message
source: Your payment was done successfully. A popup was added to your balance, it will appear once you consumed your existing data.
ar: تمت عملية الدفع بنجاح .تمت إضافة تعبئة Ap إلى رصيدك، ستظهر بمجرد استهلاك بياناتك الحالية.

# topup.title
source: Top up
ar: شحن الرصيد

# topUpWallet_error
source: Top up wallet failed
ar: فشل في تعبئة المحفظة
fr: Échec de la recharge du portefeuille

source: Top up wallet success
ar: تم تعبئة المحفظة بنجاح
fr: Recharge du portefeuille réussie

source: Total
ar: الإجمالي

# TotalPaid.title
source: Total Paid
ar: المبلغ الإجمالي المدفوع

# UnitPrice.title
source: Buy now %@
ar: %@ - اشتري الأن

source: Unlimited
ar: غير محدود
fr: Illimité

# unlimited_data_bundle
source: Data Bundle
ar: حزمة بيانات
fr: Forfait données

# unlimited.title
source: Unlimited
ar: غير محدود

# upgrade.title
source: Upgrade
ar: ترقية

# upgrade.wallet.message
source: Enter the amount number to add funds to your wallet
ar: أدخل المبلغ لإضافة أموال إلى محفظتك

# upgradeWallet_buttonTextText
source: Upgrade
ar: ترقية
fr: Recharger

# upgradeWallet_contentText
source: Enter the amount number to add funds to your wallet
ar: أدخل المبلغ لإضافة أموال إلى محفظتك
fr: Entrez le montant à ajouter à votre portefeuille

# upgradeWallet_enterNumber
source: Enter number
ar: أدخل الرقم
fr: Entrez le numéro

# upgradeWallet_hintText
source: Amount Number
ar: قيمة المبلغ
fr: Montant

# upgradeWallet.success.message
source: Upgrading your wallet was done successfully.
ar: تم ترقية محفظتك بنجاح.

# upgradeWallet.success.title
source: Hurray!
ar: مرحى!

# UpgradeWallet.title
source: Upgrade Wallet
ar: ترقية المحفظة

# userguide_iphonesetup
source: How to set up your eSIM on your iPhone
ar: كيفية إعداد شريحة eSIM على iPhone الخاص بك
fr: Comment configurer votre eSIM sur votre iPhone

# userGuide.title
source: User Guide
ar: دليل المستخدم
fr: Guide de l’utilisateur

# userGuideView_androidCameraTitle
source: Scan QR Code through your camera
ar: مسح رمز الاستجابة السريعة بالكاميرا
fr: Scanner le code QR avec votre appareil photo

# userGuideView_androidGalleryTitle
source: Scan QR Code from your gallery
ar: مسح رمز الاستجابة السريعة من معرض الصور
fr: Scanner le code QR depuis votre galerie

# userGuideView_androidStep1
source: Talk to your Team of Experts to set up your postpaid plan. You will need to provide your device EID to the Expert to update your account. A QR code will be delivered to you via email for activation. To learn how to access your QR code scanner and add your new line, follow these steps:
ar: تحدث إلى فريق الخبراء لإعداد خطة الدفع الآجل. تحتاج إلى تقديم EID الخاص بجهازك إلى الخبير لتحديث حسابك. سيتم تسليم رمز الاستجابة السريعة إليك عبر البريد الإلكتروني للتفعيل. ولمعرفة كيفية الوصول إلى ماسح رمز الاستجابة السريعة وإضافة السطر الجديد، اتبع الخطوات التالية:
fr: Contactez votre équipe d’experts pour configurer votre forfait postpayé. Vous devrez fournir l’EID de votre appareil à l’expert pour mettre à jour votre compte. Un code QR vous sera envoyé par e-mail pour l’activation. Pour apprendre à accéder au scanner de codes QR et ajouter votre nouvelle ligne, suivez ces étapes :

# userGuideView_androidStep2
source: Go to the Home screen. To open the menu, swipe up on the screen.
ar: انتقل إلى الشاشة الرئيسية. لفتح القائمة، مرر سريعًا لأعلى على الشاشة.
fr: Allez à l’écran d’accueil. Pour ouvrir le menu, faites glisser vers le haut sur l’écran.

# userGuideView_androidStep3
source: Scroll to the right. Choose Settings.
ar: انتقل إلى اليمين، واختر الإعدادات.
fr: Faites défiler vers la droite. Choisissez Paramètres.

# userGuideView_androidStep4
source: Scroll down. Choose Connections.
ar: مرِّر لأسفل، واختر الاتصالات.
fr: Faites défiler vers le bas. Choisissez Connexions.

# userGuideView_androidStep5
source: Choose SIM card manager.
ar: اختر إدارة شريحة SIM.
fr: Choisissez Gestionnaire de carte SIM.

# userGuideView_androidStep6
source: Under eSIMs, choose Add mobile plan.
ar: ضمن eSIM، اختر إضافة خطة جوال.
fr: Sous eSIM, choisissez Ajouter un forfait mobile.

# userGuideView_androidStep7
source: Choose Scan carrier QR code.
ar: اختر مسح رمز الاستجابة السريعة الخاص بشركة الاتصالات.
fr: Choisissez Scanner le code QR de l’opérateur.

# userGuideView_androidStep8
source: To scan a QR code, point the camera at the code.
ar: لمسح رمز الاستجابة السريعة، وجّه الكاميرا نحو الرمز.
fr: Pour scanner un code QR, pointez la caméra vers le code.

# userGuideView_androidStep9
source: Choose Confirm.
ar: اختر تأكيد.
fr: Choisissez Confirmer.

# userGuideView_androidStep10
source: The eSIM profile is being downloaded. This can take up to 5 minutes.
ar: جارٍ تنزيل ملف eSIM. قد يستغرق ذلك ما يصل إلى 5 دقائق.
fr: Le profil eSIM est en cours de téléchargement. Cela peut prendre jusqu’à 5 minutes.

# userGuideView_androidStep11
source: You have scanned your QR code and added your postpaid plan. Return to the Home screen.
ar: لقد مسحت رمز الاستجابة السريعة وأضفت خطة الدفع الآجل. ارجع إلى الشاشة الرئيسية.
fr: Vous avez scanné votre code QR et ajouté votre forfait postpayé. Retournez à l’écran d’accueil.

# userGuideView_androidStep12
source: To turn on data roaming, follow these steps:
ar: لتشغيل تجوال البيانات، اتبع الخطوات التالية:
fr: Pour activer l’itinérance des données, suivez ces étapes :

# userGuideView_androidStep13
source: Go to the Home screen. To open the menu, swipe up on the screen.
ar: انتقل إلى الشاشة الرئيسية. لفتح القائمة، اسحب الشاشة لأعلى.
fr: Allez à l’écran d’accueil. Pour ouvrir le menu, faites glisser vers le haut sur l’écran.

# userGuideView_androidStep14
source: Scroll to the right. Choose Settings.
ar: انتقل إلى اليمين، واختر الإعدادات.
fr: Faites défiler vers la droite. Choisissez Paramètres.

# userGuideView_androidStep15
source: Scroll down. Choose Connections.
ar: مرِّر لأسفل، واختر الاتصالات.
fr: Faites défiler vers le bas. Choisissez Connexions.

# userGuideView_androidStep16
source: Choose Mobile networks.
ar: اختر شبكات المحمول.
fr: Choisissez Réseaux mobiles.

# userGuideView_androidStep17
source: Turn on Data roaming.
ar: شغِّل تجوال البيانات.
fr: Activez l’itinérance des données.

# userGuideView_androidStep18
source: Data roaming has been turned on. Return to the Home screen.
ar: لقد تم تشغيل تجوال البيانات. ارجع إلى الشاشة الرئيسية.
fr: L’itinérance des données est activée. Retournez à l’écran d’accueil.

# userGuideView_androidTitle
source: How To Setup Your eSIM On Android
ar: كيفية إعداد شريحة eSIM في نظام Android
fr: Comment configurer votre eSIM sur Android

# userGuideView_iosStep1
source: Talk to your Team of Experts to set up your postpaid plan. You will need to provide your device EID to the Expert to update your account. A QR code is only needed if the auto-discovery notification is not received and will be delivered to you via email for activation. To learn how to access your QR code scanner and add your new line, follow these steps:
ar: تحدث إلى فريق الخبراء لإعداد خطة الدفع الآجل. تحتاج إلى تقديم EID الخاص بجهازك إلى الخبير لتحديث حسابك. لا يلزم رمز الاستجابة السريعة إلا إذا لم يتم استلام إشعار الاكتشاف التلقائي وسيتم تسليمه إليك عبر البريد الإلكتروني للتنشيط. ولمعرفة كيفية الوصول إلى ماسح رمز الاستجابة السريعة وإضافة السطر الجديد، اتبع الخطوات التالية:
fr: Contactez votre équipe d’experts pour configurer votre forfait postpayé. Vous devrez fournir l’EID de votre appareil à l’expert pour mettre à jour votre compte. Un code QR est nécessaire uniquement si la notification de découverte automatique n’est pas reçue et vous sera envoyé par e-mail pour l’activation. Pour apprendre à accéder au scanner de codes QR et ajouter votre nouvelle ligne, suivez ces étapes :

# userGuideView_iosStep2
source: Go to the Home screen. Choose Settings.
ar: انتقل إلى الشاشة الرئيسية. اختر الإعدادات.
fr: Allez à l’écran d’accueil. Choisissez Paramètres.

# userGuideView_iosStep3
source: Scroll down. Choose Cellular.
ar: مرِّر لأسفل، واختر شبكة الجوّال.
fr: Faites défiler vers le bas. Choisissez Données cellulaires.

# userGuideView_iosStep4
source: Choose Add Cellular Plan.
ar: اختر إضافة خطة خلوية.
fr: Choisissez Ajouter un forfait cellulaire.

# userGuideView_iosStep5
source: Scan the QR code sent to you via email by your Team of Experts.
ar: امسح رمز الاستجابة السريعة المرسل إليك عبر البريد الإلكتروني من قبل فريق الخبراء.
fr: Scannez le code QR envoyé par e-mail par votre équipe d’experts.

# userGuideView_iosStep6
source: Choose Add Cellular Plan.
ar: اختر إضافة خطة خلوية.
fr: Choisissez Ajouter un forfait cellulaire.

# userGuideView_iosStep7
source: Choose Continue.
ar: اختر متابعة.
fr: Choisissez Continuer.

# userGuideView_iosStep8
source: Choose an option, in this case, Secondary.
ar: اختر خيارًا، في هذه الحالة، سيكون ثانويًا.
fr: Choisissez une option, ici Secondaire.

# userGuideView_iosStep9
source: Choose Continue.
ar: اختر متابعة.
fr: Choisissez Continuer.

# userGuideView_iosStep10
source: Choose an option, in this case, Secondary.
ar: اختر خيارًا، في هذه الحالة، سيكون ثانويًا.
fr: Choisissez une option, ici Secondaire.

# userGuideView_iosStep11
source: Optional: Turn on Allow Cellular Data Switching. Choose Done.
ar: اختياري: قم بتشغيل السماح بتبديل البيانات الخلوية. اختر تم.
fr: Optionnel : activez Autoriser le changement de données cellulaires. Choisissez Terminé.

# userGuideView_iosStep12
source: You have scanned your QR code and added your postpaid plan. Return to the Home screen.
ar: لقد مسحت رمز الاستجابة السريعة وأضفت خطة الدفع الآجل. ارجع إلى الشاشة الرئيسية.
fr: Vous avez scanné votre code QR et ajouté votre forfait postpayé. Retournez à l’écran d’accueil.

# userGuideView_iosStep13
source: To turn on data roaming, follow these steps:
ar: لتشغيل تجوال البيانات، اتبع الخطوات التالية:
fr: Pour activer l’itinérance des données, suivez ces étapes :

# userGuideView_iosStep14
source: Go to the Home screen. Choose Settings.
ar: انتقل إلى الشاشة الرئيسية. اختر الإعدادات.
fr: Allez à l’écran d’accueil. Choisissez Paramètres.

# userGuideView_iosStep15
source: Scroll down. Choose Cellular.
ar: مرِّر لأسفل، واختر شبكة الجوّال.
fr: Faites défiler vers le bas. Choisissez Données cellulaires.

# userGuideView_iosStep16
source: Choose Cellular Data Options.
ar: اختر خيارات البيانات الخلوية.
fr: Choisissez Options de données cellulaires.

# userGuideView_iosStep17
source: Turn on Data Roaming.
ar: قم بتشغيل تجوال البيانات.
fr: Activez l’itinérance des données.

# userGuideView_iosStep18
source: Data roaming has been turned on. Return to the Home screen.
ar: لقد تم تشغيل تجوال البيانات. ارجع إلى الشاشة الرئيسية.
fr: L’itinérance des données est activée. Retournez à l’écran d’accueil.

# userGuideView_iosTitle
source: How To Setup Your eSIM On iPhone
ar: كيفية إعداد شريحة eSIM في iPhone
fr: Comment configurer votre eSIM sur iPhone

# userGuideView_selectMethod
source: Select a method according to your device ability
ar: حدد الطريقة وفقًا لإمكانات جهازك
fr: Sélectionnez une méthode selon les capacités de votre appareil

# userGuideView_stepIndexTitle
source: Step {index}
ar: خطوة {index}
fr: Étape {index}

# userGuideView_titleText
source: User Guide
ar: دليل المستخدم
fr: Guide de l’utilisateur

# userGuideView.androidGuideFifthStep
source: Tap on the “Scan QR code” button, and the device will scan the image and open the link or information encoded in the QR code.
ar: اضغط على زر «مسح رمز الاستجابة السريعة»، وسيمسح الجهاز الصورة ضوئيًا ويفتح الرابط أو المعلومات المشفرة في رمز الاستجابة السريعة.

# userGuideView.androidGuideFifthTextTitle
source: This is not an exhaustive list and other devices may also support this feature, but it’s best to check the specific device and software version to confirm if it is supported or not. Please keep in mind that the feature may not be available on all Samsung devices, and also, the device must be updated to the latest software version to support this feature.
ar: هذه ليست قائمة شاملة وقد تدعم الأجهزة الأخرى هذه الميزة أيضًا، ولكن من الأفضل التحقق من إصدار الجهاز والبرنامج المحدد للتأكد مما إذا كان مدعومًا أم لا.\n\nيُرجى الأخذ في الاعتبار أن الميزة قد لا تكون متاحة على جميع أجهزة Samsung، وأيضًا، يجب تحديث الجهاز إلى أحدث إصدار من البرنامج لدعم هذه الميزة.

# userGuideView.androidGuideFirstStep
source: Open the Gallery app on your Samsung device.
ar: افتح تطبيق المعرض على جهاز Samsung.

# userGuideView.androidGuideFirstTextTitle
source: Some devices have the built-in ability to scan QR codes automatically from the gallery. Here’s how to do it on Samsung devices running One UI 3.0 or later:
ar: تتمتع بعض الأجهزة بالقدرة المدمجة على مسح رموز الاستجابة السريعة تلقائيًا من المعرض. فيما يلي كيفية القيام بذلك على أجهزة Samsung التي تعمل بنظام One UI 3.0 أو الأحدث:

# userGuideView.androidGuideFourthStep
source: A pop-up window should appear at the bottom of the screen, with a button that says “Scan QR code.
ar: يجب أن تظهر نافذة منبثقة في الجزء السفلي من الشاشة، مع زر مكتوب عليه «مسح رمز الاستجابة السريعة».

# userGuideView.androidGuideFourthTextTitle
source: Some of the Samsung devices that are known to support this feature include:
ar: بعض أجهزة Samsung المعروفة بدعم هذه الميزة تتضمن ما يلي:

# userGuideView.androidGuideSecondStep
source: Navigate to the image of the QR code.
ar: انتقل إلى صورة رمز الاستجابة السريعة.
